export default function CommentsRules() {
  return (
    <div className="py-10 lg:px-10 px-8">
      <h1 className="text-2xl text-neutral-600 font-irsansb dark:text-white">
        قوانین انتشار نظرات کاربران
      </h1>
      <h3 className="text-lg py-6 text-neutral-600 dark:text-white">
        شرایط ثبت نظرات کاربران در صفحات محصول:
      </h3>
      <div className="leading-8 text-[15px] text-neutral-500 dark:text-neutral-300 text-justify">
        <p>
          نظر، عکس و ویدئوی ارسال شده‌ی شما برای دیجی‌کالا و راهنمایی سایر
          کاربران اهمیت بسیاری دارد و پیش از هر چیز از زمانی که برای ثبت آن صرف
          می‌کنید سپاسگزاریم. محتوای ارائه شده‌ی شما پس از ثبت، توسط کارشناسان
          دیجی‌کالا مورد بررسی و سپس مورد تایید و پیگیری قرار خواهد گرفت.
          خواهشمندیم برای استفاده‌ی همگان از تجربه‌ی ارزشمند خرید خود موارد ذیل
          را در هنگام ثبت نظر یا ارسال عکس و ویدئو مد نظر داشته باشید:
        </p>
        <ul className="list-disc">
          <li>
            لازم است محتوای ارسالی منطبق برعرف و شئونات جامعه و با بیانی رسمی و
            عاری از لحن تند، تمسخرو توهین باشد.
          </li>
          <li>
            محتوای ارسالی نمی‌تواند شامل اطلاعات شخصی، راه‌های ارتباطی، آدرس
            لینک و وب‌سایت‌ها و شبکه‌های اجتماعی باشد.
          </li>
          <li>
            برای برخی گروه‌های کالایی مانند لوازم بهداشت جنسی امکان ارسال عکس و
            ویدئو وجود ندارد.
          </li>
          <li>
            برای پرسش درباره‌ی اطلاعات کالا یا رویه‌های فروش می‌توانید از قسمت
            پرسش و پاسخ به جای قسمت نظرات استفاده کنید.
          </li>
          <li>
            در نظر داشته باشید هدف نهایی از ارائه‌ی نظر درباره‌ی کالا ارائه‌ی
            اطلاعات مشخص و دقیق برای راهنمایی سایر کاربران در پروسه‌ی خرید یک
            محصول توسط ایشان است؛ به همین منظور از درج نظرات گمراه‌کننده یا
            نظراتی که جنبه‌ی تبلیغاتی برای سایر محصولات یا فروشندگان داشته باشند
            یا منافع سایر کاربران را تحت الشعاع قرار دهند، خودداری کنید.
          </li>
          <li>
            کاربران می‌توانند نقد خود به خدمات دیجی‌کالا یا فروشندگان (غیر مرتبط
            به کالای مربوطه یا تجربه‌ی استفاده از آن) را از طریق فرم تماس با ما
            اعلام کنند.
          </li>
          <li>
            نظرات کاربرانی که دارای نام کاربری (نام و نام خانوادگی در حساب
            کاربری) نامناسب هستند مورد تایید قرار نخواهد گرفت.
          </li>
          <li>
            نتیجه بررسی نظرات (تایید یا رد) به ایمیل کاربران ارسال می‌شود. لذا
            جهت اطمینان از دریافت نتیجه بررسی نظرات، نیاز است کاربران آدرس ایمیل
            خود را در حساب کاربری تعریف کنند.
          </li>
        </ul>
      </div>
      <h3 className="text-lg py-6 text-neutral-600 dark:text-white">
        شرایط و قوانین افزودن عکس و ویدیو به نظرات در صفحات محصول:
      </h3>
      <div className="leading-8 text-[15px] text-neutral-500 dark:text-neutral-300 text-justify">
        <ul className="list-disc">
          <li>
            تنها در صورتی که خریدار محصول باشید امکان بارگذاری ویدئو و عکس از
            محصول در قسمت نظرات برای شما وجود خواهد داشت.
          </li>
          <li>
            وجود هرگونه گفتار، نشان یا متن تبلیغاتی یا راه‌های ارتباطی مختلف
            غیرمجاز است (شماره تلفن، ‌آدرس، مشخصات شبکه اجتماعی و ...).
          </li>
          <li>
            در صورت مشخص بودن اطلاعات تماس و آدرس خریدار روی جعبه دیجی‌کالا (در
            ویدیوهای جعبه‌گشایی)، هیچگونه مسئولیتی متوجه شرکت دیجی‌کالا نخواهد
            بود.
          </li>
          <li>
            پوشش نامناسب یا خارج از عرف و برخورداری کاربر از تتو منجر به رد
            محتوای تصویری می‌شود.
          </li>
          <li>
            محتوای تصویری با کیفیت بسیار پایین، به‌خصوص زمانی که اطلاعات خاصی را
            به سایر کاربران منتقل نمی‌کند، مورد تایید نیست.
          </li>
        </ul>
      </div>
      <h3 className="text-lg py-6 text-neutral-600 dark:text-white">
        توجه داشته باشید:{" "}
      </h3>
      <div className="leading-8 text-[15px] text-neutral-500 dark:text-neutral-300 text-justify">
        <p>
          نظرات ثبت شده توسط کاربران در وب ‌سایت، تجربه یا اطلاعات شخصی آنها در
          مورد محصولات است و برای نظردهنده و دیجی‌کالا ایجاد مسئولیت نمی‌کند
          <br />. نظر یا پرسش و پاسخ فقط باید در رابطه با کالا باشد، بنابراین
          برای پیگیری یا سوال درباره سفارش یا استفاده از خدمات پس از فروش با
          امور مشتریان دیجی‌کالا (شماره تلفن ‌ (۶۱۹۳۰۰۰۰ ) تماس بگیرید یا از
          طریق فرم صفحه &quot; تماس با ما &quot; با انتخاب موضوع پیگیری سفارش یا
          خدمات پس از فروش، سوال یا درخواست خود را مطرح کنید.
          <br /> برای ارسال سایر درخواست‌ها یا پیشنهادات ، انتقاد یا شکایت های
          خود و همچنین گزارش تخلف فروش (نظیر گزارش کالای غیراصل) نیز از فرم صفحه
          &quot; تماس با ما &quot; استفاده کنید یا به ایمیل آدرس
          Info@digikala.com ایمیل ارسال کنید.
        </p>
      </div>
    </div>
  );
}
