import {
  Armchair,
  Gem,
  HeartPulse,
  Laptop,
  PencilRuler,
  Refrigerator,
  Shirt,
  Smartphone,
} from "lucide-react";

export const categories = [
  {
    id: 1,
    title: "موبایل",
    icon: <Smartphone size={16} />,
    href: "/",
    submenu: [
      {
        title: "برندهای مختلف گوشی موبایل",
        list: ["گوشی آیفون", "گوشی سامسونگ", "گوشی شیائومی", "گوشی نوکیا"],
      },
      {
        title: "گوشی براساس قیمت",
        list: [
          "گوشی موبایل ارزان",
          "گوشی موبایل قسطی",
          "گوشی تا 2 میلیون",
          "گوشی تا 5 میلیون",
        ],
      },
      {
        title: "لوازم جانبی موبایل",
        list: [
          "شارژر گوشی",
          "قاب و کاور گوشی",
          "گلس گوشی",
          "هولدر گوشی موبایل",
          "کابل شارژ و مبدل",
          "پاوربانک (شارژر همراه)",
        ],
      },
      {
        title: "داغ ترین ها",
        list: [
          "گلکسی S23 Ultra",
          "گلکسی A54",
          "گلکسی A34",
          "گلکسی A24",
          "گلکسی A14",
        ],
      },
    ],
  },
  {
    id: 2,
    title: "کتاب، لوازم التحریر و هنر",
    icon: <PencilRuler size={16} />,
    href: "/",
    submenu: [
      { title: "کتاب و مجله", list: ["کتاب چاپی", "مجلات خارجی و داخلی"] },
      {
        title: "محتوای آموزشی",
        list: [
          "آموزش موسیقی",
          "آموزش ورزش و سرگرمی",
          "آموزش زبان",
          "آموزش نرم افزار و کامپیوتر",
        ],
      },
      {
        title: "لوازم التحریر",
        list: [
          "لوازم اداری و اقلام مصرفی",
          "کیف، کوله پشتی و جامدادی",
          "چراغ مطالعه",
          "کاغذ کادو، پاکت و کارت هدیه",
        ],
      },
      {
        title: "آلات موسیقی",
        list: [
          "لوازم جانبی آلات موسیقی",
          "گیتار",
          "کیبورد و ارگ",
          "ویولن",
          "پیانو دیجیتال",
        ],
      },
      { title: "کتاب صوتی", list: [""] },
    ],
  },
  {
    id: 3,
    title: "کالای دیجیتال",
    icon: <Laptop size={16} />,
    href: "/",
    submenu: [
      {
        title: "لپ تاپ",
        list: [
          "لپ تاپ ایسوس",
          "لپ تاپ لنوو",
          "مک بوک",
          "لپ تاپ HP",
          "لپ تاپ دل",
          "لپ تاپ ایسر",
          "لپ تاپ ام ای آی",
          "لپ تاپ کاستوم",
        ],
      },
      {
        title: "هدفون",
        list: [
          "هدفون بی سیم",
          "هدفون اپل (ایرپاد)",
          "هدفون بیتس",
          "هدفون سونی",
          "هدفون سامسونگ",
          "هدفون شیائومی",
          "هدفون جی بی ال",
          "هدفون ریزر",
        ],
      },
      {
        title: "پرینتر",
        list: [
          "پرینتر سه بعدی",
          "پرینتر حرارتی",
          "پرینتر رنگی",
          "پرینتر لیبل زن",
          "پرینتر اچ پی",
        ],
      },
      {
        title: "ماشین های اداری",
        list: ["کابل پرینتر", "کارتریج"],
      },
      {
        title: "تبلت",
        list: [""],
      },
      {
        title: "خانه هوشمند",
        list: [
          "نور و روشنایی هوشمند",
          "کلید و پریز هوشمند",
          "سنسور هوشمند",
          "جارو هوشمند (رباتیک)",
        ],
      },
    ],
  },
  {
    id: 4,
    title: "مد و پوشاک",
    icon: <Shirt size={16} />,
    href: "/",
    submenu: [
      {
        title: "لباس مردانه",
        list: [
          "تی شرت مردانه",
          "پیراهن مردانه",
          "سویشرت مردانه",
          "ژاکت و پلیور مردانه",
          "هودی مردانه",
        ],
      },
      {
        title: "لباس زنانه",
        list: [
          "پیراهن و لباس مجلسی زنانه",
          "دامن زنانه",
          "سویشرت زنانه",
          "شلوار جین زنانه",
          "لگ زنانه",
          "هودی زنانه",
        ],
      },
      {
        title: "لباس دخترانه",
        list: [
          "کاپشن دخترانه",
          "پالتو دخترانه",
          "سویشرت و هودی دخترانه",
          "کت، جلیقه و ست رسمی دخترانه",
          "جوراب و ساق دخترانه",
          "لباس راحتی دخترانه",
        ],
      },
      {
        title: "پوشاک بچگانه",
        list: [""],
      },
    ],
  },
  {
    id: 5,
    title: "آرایشی بهداشتی",
    icon: <HeartPulse size={16} />,
    href: "/",
    submenu: [
      {
        title: "لوازم آرایشی",
        list: [
          "آرایش صورت",
          "آرایش ابرو",
          "آرایش چشم",
          "آرایش لب",
          "بهداشت و زیبایی ناخن",
          "ابزار آرایشی",
        ],
      },
      {
        title: "مراقبت و زیبایی مو",
        list: ["شامپو و مراقبت مو", "آرایش مو"],
      },
      {
        title: "مراقبت پوست",
        list: ["تونر", "کرم مرطوب کننده وآبرسان", "پاک کننده", "ضدآفتاب"],
      },
      {
        title: "لوازم بهداشتی",
        list: [
          "مراقبت دهان و دندان",
          "مسواک",
          "خمیردندان",
          "دئودورانت و ضدتعریق",
        ],
      },
      {
        title: "عطر و ادکلن",
        list: [
          "عطر و ادکلن زنانه",
          "عطر و ادکلن مردانه",
          "عطر جیبی",
          "بادی اسپلش",
        ],
      },
      {
        title: "لوازم شخصی برقی",
        list: [
          "سشوار",
          "اتو و حالت دهنده ی مو",
          "اصلاح موی صورت",
          "اصلاح موی سر",
        ],
      },
    ],
  },
  {
    id: 6,
    title: "لوازم خانگی برقی",
    icon: <Refrigerator size={16} />,
    href: "/",
    submenu: [
      {
        title: "صوتی و تصویری",
        list: [
          "تلویزیون",
          "ساندبار",
          "ویدیو پروژکتور",
          "پخش کننده خانگی",
          "ریموت کنترل",
          "میز تلویزیون",
        ],
      },
      {
        title: "یخچال فریزر",
        list: [
          "یخچال فریزر ساید بای ساید",
          "یخچال فریزر دوقولو",
          "یخچال فریزر هتلی",
          "یخچال فریزر کمبی",
        ],
      },
      {
        title: "جاروبرقی",
        list: ["جارو شارژی", "لوازم جانبی جاروبرقی و بخارشو"],
      },
      {
        title: "لوازم پخت و پز",
        list: [
          "سرخ کن بدون روغن (airfrier)",
          "مایکروویو، مایکروفر",
          "اجاق گاز",
          "پلوپز",
          "گریل و باربیکیو",
          "آون توستر",
          "توستر",
          "ساندویچ ساز و وافل ساز",
        ],
      },
    ],
  },
  {
    id: 7,
    title: "خانه و آشپزخانه",
    icon: <Armchair size={16} />,
    href: "/",
    submenu: [
      {
        title: "ظروف پخت و پز",
        list: ["قابلمه و تابه", "زودپز", "سرویس پخت و پز"],
      },
      {
        title: "ابزار آشپزی",
        list: ["ست کفگیر و ملاقه", "چاقو", "تخته گوشت", "ظرف و قالب یخ", "قیف"],
      },
      {
        title: "مبلمان و دکوراسین داخلی",
        list: [
          "مبل",
          "کتابخانه",
          "شلف و طبقه",
          "کنسول",
          "صندلی",
          "میز ناهارخوری",
        ],
      },
      {
        title: "حمام",
        list: ["حوله", "دمپایی", "لیف", "پرده حمام", "وان و جکوزی"],
      },
      {
        title: "سرویس بهداشتی",
        list: ["توالت فرنگی", "ست سرویس بهداشتی"],
      },
    ],
  },
  {
    id: 8,
    title: "طلا و نقره",
    icon: <Gem size={16} />,
    href: "/",
    submenu: [
      {
        title: "زیورآلات طلا زنانه",
        list: [
          "زنجیر طلا زنانه",
          "انگشتر طلا زنانه",
          "دستبند طلا زنانه",
          "النگو طلا زنانه",
          "گردنبد طلا زنانه",
          "گوشواره طلا",
        ],
      },
      {
        title: "زیورآلات نقره زنانه",
        list: [
          "زنجیر نقره زنانه",
          "انگشتر نقره زنانه",
          "دستبند نقره زنانه",
          "پیرسینگ نقره زنانه",
          "آویز ساعت نقره زنانه",
          "گردنبد نقره زنانه",
          "گوشواره نقره زنانه",
          "پابند نقره زنانه",
          "آویز نقره زنانه",
        ],
      },
      {
        title: "طلای آب شده",
        list: [""],
      },
      {
        title: "سکه طلا",
        list: [""],
      },
    ],
  },
];
